{
    "Teknik Sipil": {
      "_prodi_summary": "Prodi Teknik Sipil berfokus pada perancangan, konstruksi, dan pemeliharaan infrastruktur fisik seperti gedung, jembatan, jalan raya, bendungan, dan sistem pengelolaan air. Mahasiswa belajar prinsip-prinsip rekayasa struktur, geoteknik (tanah), hidrolika (air), transportasi, dan manajemen konstruksi.",
      "Lab Perkerasan Jalan Raya & Aspal": "Di lab ini, mahasiswa mempelajari material (terutama aspal) dan teknik yang digunakan dalam konstruksi perkerasan jalan. Fokusnya pada pengujian sifat dan kekuatan aspal, campuran beraspal, pengaruh beban lalu lintas, serta aspek lingkungan terkait konstruksi jalan.",
      "Lab Hidrolika": "Mahasiswa mendalami prinsip-prinsip mekanika fluida dan aliran air. Praktikum mencakup pengujian dan analisis aliran pada saluran terbuka (sungai, drainase), aliran dalam pipa, serta aplikasinya dalam desain bangunan air, irigasi, pengendalian banjir, dan sistem perpipaan.",
      "Lab Mekanika Tanah": "Lab ini fokus pada studi sifat fisik dan mekanik tanah serta perilakunya saat menerima beban. Mahasiswa melakukan serangkaian pengujian untuk menentukan parameter tanah seperti kepadatan, kuat geser, permeabilitas (kemampuan air meresap), dan konsolidasi (penurunan tanah), yang krusial untuk desain pondasi yang aman dan stabil.",
      "Lab Struktur & Bahan": "Mahasiswa mengkaji karakteristik dan perilaku material konstruksi utama seperti beton, baja, kayu, dan material komposit lainnya. Mereka melakukan pengujian kekuatan tarik, tekan, lentur, dan durabilitas material, serta mempelajari analisis dan desain elemen struktur dasar (balok, kolom) untuk memastikan keamanan dan kinerja bangunan.",
      "Lab Gambar Rekayasa": "Di sini, mahasiswa belajar keterampilan fundamental dalam komunikasi visual teknik, yaitu membuat dan membaca gambar teknik yang presisi. Mereka mempelajari standar penggambaran, proyeksi ortogonal, gambar detail, gambar rakitan, serta penggunaan perangkat lunak CAD (Computer-Aided Design) untuk merancang dan mendokumentasikan struktur."
    },
    "Teknik Informatika": {
      "_prodi_summary": "Prodi Teknik Informatika mempelajari dasar-dasar ilmu komputer dan teknologi informasi. Fokus utamanya meliputi pengembangan perangkat lunak (pemrograman, rekayasa perangkat lunak), jaringan komputer, sistem basis data, kecerdasan buatan (AI), keamanan siber, dan pengembangan aplikasi web/mobile.",
      "Lab Software": "Lab ini menjadi pusat pengembangan keterampilan rekayasa perangkat lunak. Mahasiswa fokus pada seluruh siklus hidup pengembangan software, mulai dari analisis kebutuhan, desain arsitektur aplikasi, implementasi (coding) dengan berbagai bahasa pemrograman, pengujian (debugging), hingga manajemen proyek perangkat lunak menggunakan metodologi modern.",
      "Lab Hardware": "Mahasiswa mendalami komponen fisik sistem komputer dan perangkat elektronik. Kegiatan praktikum meliputi perakitan dan troubleshooting PC, pemahaman arsitektur komputer, pengujian fungsionalitas perangkat keras, dasar-dasar sistem digital, serta pemrograman mikrokontroler (seperti Arduino/Raspberry Pi) dan interfacenya dengan sensor atau aktuator."
    },
    "Teknik Pertambangan": {
      "_prodi_summary": "Prodi Teknik Pertambangan fokus pada ilmu dan teknologi yang berkaitan dengan eksplorasi (pencarian), evaluasi, ekstraksi (penambangan), dan pengolahan sumber daya mineral (logam, batubara, industri) secara efisien, aman, dan berwawasan lingkungan. Topik meliputi geologi, mekanika batuan, metode penambangan, dan pengolahan bahan galian.",
      "Lab Geologi Fisik": "Di lab ini, mahasiswa mempelajari identifikasi dan sifat-sifat fisik batuan dan mineral pembentuk kerak bumi. Mereka juga mengamati dan menganalisis proses-proses geologi dasar yang membentuk permukaan bumi (pelapukan, erosi, sedimentasi) dan fenomena seperti pergerakan tanah, yang relevan untuk memahami lingkungan deposit mineral.",
      "Lab Perpetaan": "Mahasiswa belajar teknik pengukuran dan pembuatan peta topografi serta peta situasi area pertambangan. Ini mencakup penggunaan alat ukur lapangan (seperti Theodolite, Total Station, GPS Geodetik) dan pengolahan datanya menggunakan perangkat lunak pemetaan dan Sistem Informasi Geografis (SIG/GIS) untuk perencanaan tambang.",
      "Lab Mekanika Tanah": "Lab ini mempelajari sifat mekanik tanah dan batuan lunak, namun dengan penekanan pada aplikasi di bidang pertambangan. Fokusnya meliputi analisis kestabilan lereng (slope stability) pada tambang terbuka, daya dukung tanah untuk infrastruktur tambang, serta pengelolaan dan pemindahan tanah (overburden) secara efisien dan aman.",
      "Lab Mineralogi dan Petrologi": "Mahasiswa belajar mengidentifikasi berbagai jenis mineral (pembawa bijih dan pengotor) serta batuan (beku, sedimen, metamorf) menggunakan sifat fisik dan optik (dengan mikroskop polarisasi). Pemahaman ini penting untuk eksplorasi mineral, karakterisasi cebakan, dan menentukan metode pengolahan yang tepat.",
      "Lab Geologi Struktur": "Fokus lab ini adalah pada pemahaman struktur geologi skala besar seperti lipatan (folds), sesar (faults), dan kekar (joints) yang mengontrol pembentukan dan lokasi deposit mineral. Mahasiswa belajar interpretasi data geologi (peta, data bor) untuk memodelkan struktur bawah permukaan dan memprediksi potensi sumber daya."
    }
  }